tutorials/waterInjectionInOilSaturatedBeads/0/UnonWetting
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UnonWetting;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }

    outerWall
    {
       type            zeroGradient;
    }

    innerWall
    {
       type            cylindricalInletVelocity;
       axis            (0 0 0.1);
       origin          (0 0 0);
       axialVelocity   0;
       radialVelocity  0;
       rpm             0;
       value uniform (0 0 0); 
    }

}


// ************************************************************************* //
