tutorials/waterInjectionInOilSaturatedBeads/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

inletFlowRatePos     1;
inPressure           0;     
velocityBC           fixedValue;  
porousVelocityBC     slip;
pressureBC 	     fixedFluxPressure;

// ************************************************************************* //
