tutorials/waterInjectionInOilSaturatedBeads/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    innerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          800;
        startFace       1253600;
    }
    outerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          800;
        startFace       1254400;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1254400;
        startFace       1255200;
    }
)

// ************************************************************************* //
