tutorials/waterInjectionInOilSaturatedBeads/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (wetting nonWetting);


//water is wetting, oil is nonwetting
wetting
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1e-6;
    rho             [1 -3 0 0 0 0 0] 1000;   
}

nonWetting 
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.25e-4; 
    rho             [1 -3 0 0 0 0 0] 800;
}

//thermal properties
// kg m s K mol A cd
kappa_1           [1 1 -3 -1 0 0 0]  0.6; //water heat conductivity
Cp_1           [0 2 -2 -1 0 0 0]  4186; //water specific heat capacity
kappa_2           [1 1 -3 -1 0 0 0]  0.15; //oil heat conductivity
Cp_2           [0 2 -2 -1 0 0 0]  1800; //oil specific heat capacity

kappa_s           [1 1 -3 -1 0 0 0]  1; //solid heat conductivity
Cp_s           [0 2 -2 -1 0 0 0]  1350; //solid specific heat capacity
rho_s           [1 -3 0 0 0 0 0]  2650; //solid density

//// fitting coefficients for fluid density and viscosity
//density of wetting phase (water)
coeff1           [1 -3 0 -2 0 0 0]  -3.5313e-3; 
coeff2           [1 -3 0 -1 0 0 0]  1.8517; 
coeff3           [1 -3 0 0 0 0 0]  7.5847e2; 
//density of nonwetting phase (oil)
coeff4           [1 -3 0 -2 0 0 0]  8.3333e-5; 
coeff5           [1 -3 0 -1 0 0 0]  -6.7751e-1; 
coeff6           [1 -3 0 0 0 0 0]  1.0703e3; 
//dynamic viscosity of wetting phase (water)
coeff7           [1 -1 -1 -2 0 0 0]  1.8357e-7; 
coeff8           [1 -1 -1 -1 0 0 0]  -1.3104e-4; 
coeff9           [1 -1 -1 0 0 0 0]  2.3706e-2; 
//dynamic viscosity of nonwetting phase (oil)
coeff10          [1 -1 -1 -2 0 0 0]  3.3362e-5; 
coeff11          [1 -1 -1 -1 0 0 0]  -2.3780e-2; 
coeff12          [1 -1 -1 0 0 0 0] 4.2458; 


//Choose solid rheology model
transportModel  HerschelBulkleyQuemada; 
   
    HerschelBulkleyQuemadaCoeffs
    {
	    nu0      [ 0 2 -1 0 0 0 0 ] 1e05; //viscocity at low stresses      
        tau0     [ 0 2 -2 0 0 0 0 ] 0.22; //yield stres
	    epssMax  [ 0 0 0 0 0 0 0 ] 0.74; //maximum porosity
        nuf        [ 0 2 -1 0 0 0 0 ] 1e-6; //minumum viscocity 
	    Dstar    [ 0 0 0 0 0 0 0 ] 1.1; //fractar coefficient
        n        [ 0 0 0 0 0 0 0 ] 1; //power law coefficient
    }     

activateSolidMechanics         0; //activate solid mechanics?
activateCapillarity            1; //activate capillary model?
activatePorousContactAngle     0; //activate porous contact angle?
theta0                         45; //porous contact angle
activateSwellingPressure       0; //activate swelling pressure?
activateTemperatureDependenceOfProperties  1; //activate temperature dependence for viscosity and density
activateTemperatureDependenceOfCapillarity  1; //activate temperature dependence for capillary pressure
activateTemperatureDependenceOfPermeability  1; //activate temperature dependence for absolute permeability
activatePressureDependenceOfDensityForWettingPhase 0; // activate pressure dependence of density using the ideal gas law for wetting phase
activatePressureDependenceOfDensityForNonWettingPhase 0; // activate pressure dependence of density using the ideal gas law for nonwetting phase

// Volume viscosity and swelling correction parameters
kappaDyn0      [1 -1 -1 0 0 0 0]   0;    // Base dynamic bulk viscosity [Pa·s]
mCompaction    [0 0 0 0 0 0 0]     2;    // Compaction exponent [-]
Ks          [1 -1 -2 0 0 0 0]     3e7;    // // Bulk modulus of solid

// Temperature dependence coefficient
sigma            [1 0 -2 0 0 0 0]  0.030; //surface tension between oil and water
invFk0           [0 -2 0 0 0 0 0]  0; //2D correction 
T0               [0 0 0 1 0 0 0]   300; //ambient temperature
coeffSigma       [0 0 0 -1 0 0 0]  -4.7512e-3; //change rate of surface tension as a function of temperature


alpha.wettingmin           alpha.wettingmin [0  0  0 0 0 0 0] 0;
alpha.wettingmax           alpha.wettingmax [0  0  0 0 0 0 0] 0.999;


//choose relative and capillary pressure models
relativePermeabilityModel  BrooksAndCorey;
capillarityModel           BrooksAndCorey;

BrooksAndCoreyCoeffs
{
    n 2;
    Sbminpc Sbminpc [0 0 0 0 0 0 0] 0;
    Sbmaxpc Sbmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 1000;
    alpha 0.5;  
}

// ************************************************************************* //
